<svelte:head>
  <title>第二届中国 PWA 开发者日 | China PWA Developer Day 2022</title>
</svelte:head>

<h1>第二届中国 PWA 开发者日</h1>

为加速推动渐进式 Web 应用 (PWA) 在中国的发展，微软、英特尔与谷歌于 2022 年 8 月
6 日携手举办<a href="../blog/the-china-pwa-developer-day-was-successfully-held"
  >第二届中国 PWA 开发者日</a
>活动。 本次活动邀请一众业界大咖围绕 PWA 展开分享，探讨最新技术进展，以及 PWA
生态的实践与落地。

<div class="section">
  <h1><a href="../blog/opening">开幕致辞</a></h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798204919&amp;aid=514337530&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1ug411k7jR"
          title="开幕致辞 - 张琦"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a href="https://youtu.be/gfzYAe24Lpo" title="开幕致辞 - 张琦">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      新的一年渐进式 Web 应用 (PWA) 又有了更多能力的引入和性能的提升，PWA
      正在在技术演进的路上狂飙。我们很欣慰地见到 PWA
      更紧密的操作系统集成和改进的用户体验，也很高兴 PWA
      技术在国内各大厂商的业务实践中落地和发展。<br /><br />让我们携手推动开放的
      PWA
      为开发者带来更高的开发效率，为客户提供更广阔的商业价值，为用户带来更便利的一致性跨平台体验。
    </div>

    <div class="details">
      <div class="avatar" id="icon_qi" />
      <div class="description">
        <div class="name">张琦</div>
        <div class="title">资深技术总监</div>
        <div class="company">英特尔 SATG Web 平台工程</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1><a href="../blog/open-speech">开场演讲 PWAs &amp; MiniApps</a></h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=807037905&amp;aid=387238365&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV12d4y1R78s"
          title="开场演讲 PWAs &amp; MiniApps - Alex Russell"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a href="" title="开场演讲 PWAs &amp; MiniApps - Alex Russell">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      之于迅速缩小和小程序功能差距的背景之下，拥抱小程序生态，PWA 大有机会！<br
      /><br />过去 6 年来 PWA 本地原生能力的不断增强加上新兴的 Web Packaging 和
      Web Bundles 标准，如何为 Web
      开发者打造融合小程序生态的伟大平台；浏览器开发者支持小程序融合生态的机会所在；坚持
      Web 标准之于跨设备的优势；将 Web 视为应用平台的集散地的优势。<br /><br
      />As the father of the PWA, Alex will give us the open speech to discuss
      below topics:<br /><br />The PWA opportunity in the context of closing the
      gaps with MiniApps capabilities: How emerging standards (Web Packaging and
      Web Bundles) along with the last 6 years of progress in PWA capabilities
      set the web up to be a great platform for challenger apps looking to grow
      a mini-app ecosystem. The opportunities to browser makers for supporting
      this work. The cross-device advantages of building for a standards-based
      platform. Export-market benefits of considering the web as an application
      platform.
    </div>

    <div class="details">
      <div class="avatar" id="icon_alex" />
      <div class="description">
        <div class="name">Alex Russell</div>
        <div class="title">PWA 之父 全球合伙人产品经理</div>
        <div class="company">微软 Edge 浏览器团队</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a href="../blog/take-full-advantage-of-a-pwa"
      >Take Full Advantage of a PWA</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798212600&amp;aid=386851567&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV14d4y1m7wr"
          title="Take Full Advantage of a PWA - 丛慧君"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/yx3sToxmVmA"
          title="Take Full Advantage of a PWA - 丛慧君"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      本演讲将引导您了解 PWA 中的现有工具和功能，以创建增强的体验。<br /><br
      />This talk walks you through the existing tools and features in PWAs to
      create enhanced experiences.
    </div>

    <div class="details">
      <div class="avatar" id="icon_cecilia" />
      <div class="description">
        <div class="name">丛慧君</div>
        <div class="title">高级解决方案顾问</div>
        <div class="company">Google Chrome &amp; Web Platform</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a href="../blog/revisiting-the-real-world-significance-of-pwa-technology"
      >回归初心，重温 PWA 技术的现实意义</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=807060425&amp;aid=857160761&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1KV4y1x7hz"
          title="回归初心，重温 PWA 技术的现实意义 - 宋青见"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/jRVHBMNL1YQ"
          title="回归初心，重温 PWA 技术的现实意义 - 宋青见"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      互联网诞生于自由平等的共享和创建内容的初衷，网页和论坛是曾经梦想开始的地方，移动互联网的发展创建了新的基于应用的方式来获取内容，越来越让人感到一个一个的平行世界，而成为信息的孤岛，从而让人非常怀念当年看似简陋但是便于分享和传播的网页时代。<br
      /><br
      />随着微信小程序等基于Web技术的新的应用开发模式的兴起，应用和网页内容的界限不断被打破，用户社交分享或者扫描二维码来获取网页内容，已经升级为“内容+交互能力”的“小程序”。应用不再是一个个必须回到桌面再进入的图标，而是卡片、浮窗等更有利于内容的触达和分享的新的方式。此时重温PWA-渐进式Web应用，就特别能够理解Web技术不断发展，网页具备应用的能力已在眼前，对前端技术开发者而言，用统一的标准化的Web技术，实现网站到应用的自然转变，实现网站“内容即应用”并在多端之间“自由分享和运行”，已经垂手可得！<br
      /><br />PWA 的想法是由 Google 工程师 Alex Russell 在2015 年提出的,
      Alex于2021年加入微软Edge团队。基于
      Chromium内核的新版微软Edge浏览器于2020年1月15日发布，对整个前端技术的发展意义深远,
      Web技术的底层框架趋于统一，有利于桌面和移动端原本两个独立的生态走向协同和融合。本次演讲将为大家介绍
      PWA技术的最新进展，并通过 Windows + Edge 深度融合，使网页具备 OS
      原生应用的能力, 从而降低应用开发的成本，回归内容为本质的初心。<br /><br
      />正所谓，跨端离不开现代化的 Windows 桌面，现代化的 Windows
      桌面全力支持跨端的 PWA！
    </div>
    <div class="details">
      <div class="avatar" id="icon_edwin" />
      <div class="description">
        <div class="name">宋青见</div>
        <div class="title">首席产品经理</div>
        <div class="company">微软 Edge · 开发者生态</div>
      </div>
    </div>

  </div>
</div>

<div class="section">
  <h1>
    <a href="../blog/the-world-of-pwa-tools-from-starter-to-builder"
      >The World of PWA Tools: From Starter to Builder</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=807146692&amp;aid=687238209&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1TU4y1k7SK"
          title="The World of PWA Tools: From Starter to Builder - Justin Willis &amp; Amrutha Srinivasan"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href=""
          title="The World of PWA Tools: From Starter to Builder - Justin Willis &amp; Amrutha Srinivasan"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      我们将讨论 PWA（渐进式 Web 应用程序）技术和 PWABuilder
      套件提供的工具，可帮助您从头到尾完成 PWA 构建之旅。
      我们将展示我们的一些工具的用法，并分享一些有用的资源以供进一步学习。<br
      /><br />We are going to talk about PWA (Progressive Web App) technology
      and the tools that the PWABuilder suite offers to get you from start to
      finish on your PWA building journey. We will demonstrate usage of some of
      our tools and also share some helpful resources for further learning.
    </div>

    <div class="details">
      <div class="avatar" id="icon_pwabuilder" />
      <div class="description">
        <div class="name">Justin Willis &amp; Amrutha Srinivasan</div>
        <div class="title">软件工程师</div>
        <div class="company">微软 PWABuilder</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1><a href="../blog/running-mini-apps-in-pwa">跑在 PWA 里的 '小程序'</a></h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798218378&amp;aid=771822553&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1T14y1b7JZ"
          title="跑在 PWA 里的 '小程序' - 朱天健"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/AqJFxdDQnto"
          title="跑在 PWA 里的 '小程序' - 朱天健"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      Web 端是 Taro 生态中重要的一环，随着 Taro
      逐渐成长为“开放式跨端跨框架解决方案”，Taro H5
      的架构也需要经历蜕变才能补齐自身短板，帮助开发者获得更好的体验。我们将向您介绍借助
      Taro 将小程序转换至 Web 端的方法和经验。
    </div>

    <div class="details">
      <div class="avatar" id="icon_tianjian" />
      <div class="description">
        <div class="name">朱天健</div>
        <div class="title">前端技术专家</div>
        <div class="company">京东零售集团凹凸实验室</div>
      </div>
    </div>

    <div class="det">
      朱天健，京东前端技术专家。Taro 技术委员会，核心团队成员，主要负责 Web
      端等相关能力的规划与研发工作。同时是 Tide 项目的核心开发成员，负责
      tide-site 和 cloud ide 相关的研发，开放插件协议和相关接口实现等等。2019
      年作为讲师出席第二届软件绿色联盟「构生态·建未来
      」开发者大会，受邀参加第四届 TLC 腾讯直播大会、 GMTC-2021 深圳站、QCon+
      2022。
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a href="../blog/tencent-documentation-pwa-development-practice"
      >腾讯文档 PWA 开发实践</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798221377&amp;aid=599294413&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1RB4y1z7RF"
          title="腾讯文档 PWA 开发实践 - 彭伟宏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/NjpIsuh0nig"
          title="腾讯文档 PWA 开发实践 - 彭伟宏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      腾讯文档作为一款多人在线、跨平台的协作工具，积极拥抱 Web 生态，与 PWA
      跨平台的特性强强联合，实现资源缓存控制、离线场景使用等等功能，只需维护一套代码实现多平台复用。同时在腾讯文档多品类多团队开发的基础之上，如何简易的接入并使用
      PWA 也尤为重要，此次分享将为你揭秘腾讯文档 PWA
      开发实践的那些事，让我们一起见证 PWA 技术为腾讯文档带来的更多的可能性。
    </div>

    <div class="details">
      <div class="avatar" id="icon_harry" />
      <div class="description">
        <div class="name">彭伟宏</div>
        <div class="title">前端工程师</div>
        <div class="company">腾讯 PCG 平台与内容事业群</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a
      href="../blog/the-exploration-and-practice-of-alibaba.com-pwa-to-reduce-costs-and-increase-efficiency"
      >PWA 降本增效的探索与实践</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798228237&amp;aid=814253629&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV18G4y1Y7zp"
          title="Alibaba.com PWA 降本增效的探索与实践 - 陈远宏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/n1ehX0ioRtY"
          title="Alibaba.com PWA 降本增效的探索与实践 - 陈远宏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      现在的业务，一般都会有浏览器（端外）和客户端内（端内）的场景诉求。为了追求极致，往往会让端内外的代码差异越发地大，既加大了开发者成本，也降低了整体的稳定性。今天想聊聊阿里巴巴
      ICBU 是如何处理这些问题的。<br /><br />Web
      开发虽然能够做到端内外都有基本的功能呈现，但出于对体验、稳定性、规范等考虑，又会出现端内外不一致的情况。诸如：缓存和预加载方案、原生能力调用、底层数据上报和分析等，都有所不同。<br
      /><br />这些问题来源于 PWA
      的能力和端内定制能力相似却不一致。要么增加开发者成本，要么损失一部分使用者体验。成本和体验的平衡是永恒的话题。但往往也有一条途径，那就是把一部分成本转移到工程和工具上，让开发者少了解这些差异，也能够开发出在端内外都有较好体验的产品。
    </div>

    <div class="details">
      <div class="avatar" id="icon_yuanhong" />
      <div class="description">
        <div class="name">陈远宏</div>
        <div class="title">前端工程师</div>
        <div class="company">阿里巴巴 ICBU 技术部</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a href="./blog/the-journey-of-web-nativeization">网页的原生化之旅</a>
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798231363&amp;aid=729352217&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1bS4y1s7UG"
          title="网页的原生化之旅 - 王浩宇"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/nWj5a2ABnRY"
          title="网页的原生化之旅 - 王浩宇"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      简单来讲，原生（native）的优势主要集中在较好的原生体验和低成本的用户召回，劣势在于开发迭代成本高以及不具备跨平台的能力。而
      Web App
      则几乎相反，优势主要集中在快速开发迭代和低成本多端复用，劣势在于较差的原生体验和无法召回用户。<br
      /><br />随着 PWA 能力的不断增强，Web App
      在保留现有优势的前提下，极大的扩展了原生的能力，提供了多种原生
      API，包含定位、push、添加到桌面、甚至打包成 App等能力，让 Web App
      的体验更加优秀。那么今天，我们就来聊一下，一个网页的 native 化之旅。
    </div>

    <div class="details">
      <div class="avatar" id="icon_haoyu" />
      <div class="description">
        <div class="name">王浩宇</div>
        <div class="title">前端工程师</div>
        <div class="company">抖音集团巨量千川</div>
      </div>
    </div>
  </div>
</div>

<div class="section">
  <h1>
    <a href="../blog/explore-new-web-capabilities-for-your-pwa"
      >新兴 Web 技术助力 PWA</a
    >
  </h1>
  <div class="topic">
    <div class="bili">
      <iframe
        width="1504"
        height="846"
        src="https://player.bilibili.com/player.html?cid=798234967&amp;aid=899289625&amp;page=1&amp;as_wide=1&amp;high_quality=1&amp;danmaku=0"
        scrolling="no"
        border="0"
        frameborder="no"
        framespacing="0"
        allowfullscreen="true"
      />
      <div class="pdf">
        <a
          href="https://www.bilibili.com/video/BV1tN4y157rK"
          title="新兴 Web 技术助力 PWA - 张敏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"
            ><path
              d="M488.6 104.1C505.3 122.2 513 143.8 511.9 169.8V372.2C511.5 398.6 502.7 420.3 485.4 437.3C468.2 454.3 446.3 463.2 419.9 464H92.02C65.57 463.2 43.81 454.2 26.74 436.8C9.682 419.4 .7667 396.5 0 368.2V169.8C.7667 143.8 9.682 122.2 26.74 104.1C43.81 87.75 65.57 78.77 92.02 78H121.4L96.05 52.19C90.3 46.46 87.42 39.19 87.42 30.4C87.42 21.6 90.3 14.34 96.05 8.603C101.8 2.868 109.1 0 117.9 0C126.7 0 134 2.868 139.8 8.603L213.1 78H301.1L375.6 8.603C381.7 2.868 389.2 0 398 0C406.8 0 414.1 2.868 419.9 8.603C425.6 14.34 428.5 21.6 428.5 30.4C428.5 39.19 425.6 46.46 419.9 52.19L394.6 78L423.9 78C450.3 78.77 471.9 87.75 488.6 104.1H488.6zM449.8 173.8C449.4 164.2 446.1 156.4 439.1 150.3C433.9 144.2 425.1 140.9 416.4 140.5H96.05C86.46 140.9 78.6 144.2 72.47 150.3C66.33 156.4 63.07 164.2 62.69 173.8V368.2C62.69 377.4 65.95 385.2 72.47 391.7C78.99 398.2 86.85 401.5 96.05 401.5H416.4C425.6 401.5 433.4 398.2 439.7 391.7C446 385.2 449.4 377.4 449.8 368.2L449.8 173.8zM185.5 216.5C191.8 222.8 195.2 230.6 195.6 239.7V273C195.2 282.2 191.9 289.9 185.8 296.2C179.6 302.5 171.8 305.7 162.2 305.7C152.6 305.7 144.7 302.5 138.6 296.2C132.5 289.9 129.2 282.2 128.8 273V239.7C129.2 230.6 132.6 222.8 138.9 216.5C145.2 210.2 152.1 206.9 162.2 206.5C171.4 206.9 179.2 210.2 185.5 216.5H185.5zM377 216.5C383.3 222.8 386.7 230.6 387.1 239.7V273C386.7 282.2 383.4 289.9 377.3 296.2C371.2 302.5 363.3 305.7 353.7 305.7C344.1 305.7 336.3 302.5 330.1 296.2C323.1 289.9 320.7 282.2 320.4 273V239.7C320.7 230.6 324.1 222.8 330.4 216.5C336.7 210.2 344.5 206.9 353.7 206.5C362.9 206.9 370.7 210.2 377 216.5H377z"
            /></svg
          >
        </a>
        <a
          href="https://youtu.be/yTUxqjxwQZg"
          title="新兴 Web 技术助力 PWA - 张敏"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"
            ><path
              d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"
            /></svg
          >
        </a>
        <a href="https://pan.baidu.com/s/1E0CRe7C6RZx0G8YMcxh26A?pwd=ipwa">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 512"
            ><path
              d="M144 480C64.47 480 0 415.5 0 336C0 273.2 40.17 219.8 96.2 200.1C96.07 197.4 96 194.7 96 192C96 103.6 167.6 32 256 32C315.3 32 367 64.25 394.7 112.2C409.9 101.1 428.3 96 448 96C501 96 544 138.1 544 192C544 204.2 541.7 215.8 537.6 226.6C596 238.4 640 290.1 640 352C640 422.7 582.7 480 512 480H144zM303 392.1C312.4 402.3 327.6 402.3 336.1 392.1L416.1 312.1C426.3 303.6 426.3 288.4 416.1 279C407.6 269.7 392.4 269.7 383 279L344 318.1V184C344 170.7 333.3 160 320 160C306.7 160 296 170.7 296 184V318.1L256.1 279C247.6 269.7 232.4 269.7 223 279C213.7 288.4 213.7 303.6 223 312.1L303 392.1z"
            /></svg
          >
          PDF
        </a>
      </div>
    </div>

    <div>
      2022 年，很多新兴的 Web API 加入到了 Chromium 中，使得渐进式 Web 应用
      (Progressive Web Apps, PWA) 如虎添翼。功能上，Shared Storage、Web
      Share、File System Access、File Handling 以及 Local Font Access 等等 API
      简化了 PWA 应用对系统的访问和使用，极大地降低了前端的开发成本；性能上,
      英特尔 Web 团队参与甚至领导的 Web Assembly / SIMD, WebGPU 以及 WebNN
      等等项目，充分地利用 了 Intel XPU 的能力，并将 PWA
      的性能极大地提高到和原生应用接近的水平。让我们快速了解新兴的 Web
      技术在哪些方面助力了 PWA，提升开发效率。
    </div>

    <div class="details">
      <div class="avatar" id="icon_belem" />
      <div class="description">
        <div class="name">张敏</div>
        <div class="title">软件技术经理</div>
        <div class="company">英特尔 SATG Web 平台工程</div>
      </div>
    </div>
  </div>
</div>
